# Udacity - Python

## Pandas

[Python Docs](https://docs.python.org/3/library/index.html)

[Python Reserved Words](https://docs.python.org/3/reference/lexical_analysis.html#keywords)

[PEP 8 - Style Guide for Python Code](https://peps.python.org/pep-0008/)

[PEP 257 - Docstring Conventions](https://peps.python.org/pep-0257/)

[Conda - Managing Environments](https://conda.io/projects/conda/en/latest/user-guide/tasks/manage-environments.html)

[NumPy Documentation](https://docs.scipy.org/doc/numpy-1.13.0/contents.html)

[Pandas Documentation](https://pandas.pydata.org/pandas-docs/stable/)

[Pandas - Data Structures](https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html#intro-to-data-structures)

[10 Minutes to Pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html)

### Why use Pandas?

Pandas Series and DataFrames are designed for fast data analysis and manipulation. Pandas helps with large datasets that must be manipulated prior to running within machine learning algorithms. More often than not, large datasets will often have missing values, outliers, incorrect values, etc.

### Pandas `Series`

**Series** - mutable, *one-dimensional* array-like object than can hold many data types and has an option to provide axis labels

[Pandas Series - Documentation](https://pandas.pydata.org/pandas-docs/stable/reference/series.html)

In [13]:
import pandas as pd
import numpy as np

In [3]:
groceries = pd.Series(data=[30, 6, 'Yes', 'No'], index=['eggs', 'apples', 'milk', 'bread'])

print(groceries)
print()
print('Groceries has shape:', groceries.shape)
print('Groceries has dimension:', groceries.ndim)
print('Groceries has a total of', groceries.size, 'elements')
print()
print('The data in Groceries is:', groceries.values)
print('The index of Groceries is:', groceries.index)
print()
print('Is bananas an index label in Groceries:', 'bananas' in groceries)
print('Is bread an index label in Groceries:', 'bread' in groceries)

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

Groceries has shape: (4,)
Groceries has dimension: 1
Groceries has a total of 4 elements

The data in Groceries is: [30 6 'Yes' 'No']
The index of Groceries is: Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

Is bananas an index label in Groceries: False
Is bread an index label in Groceries: True

### Access Elements

Sinc pandas can use numerical or named indices to refer to elements, Pandas uses two attributes, `.loc` and `.iloc` to remove ambiguity.

`.loc` stnads for *location* and uses a labeled index.
`.iloc` stands for *integer location* and uses a numberical index.

[Pandas Series - Indexing](https://pandas.pydata.org/pandas-docs/stable/reference/series.html#indexing-iteration)

In [4]:
print('How many eggs do we need to buy:', groceries['eggs']) # Returns a single value
print()

print('Do we need milk and bread:\n', groceries[['milk', 'bread']]) # Returns a series
print()

print('How many eggs and apples do we need to buy:\n', groceries.loc[['eggs', 'apples']]) # Returns a series
print()

print('How many eggs and apples do we need to buy:\n', groceries.iloc[[0, 1]]) # Returns a series
print()

print('Do we need bread:\n', groceries[[-1]]) # Returns a series
print()

print('How many eggs do we need to buy:', groceries[0]) # Returns a single value
print()

print('Do we need milk and bread:\n', groceries.iloc[[2, 3]]) # Returns a series

How many eggs do we need to buy: 30

Do we need milk and bread:
 milk     Yes
bread     No
dtype: object

How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object

How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object

Do we need bread:
 bread    No
dtype: object

How many eggs do we need to buy: 30

Do we need milk and bread:
 milk     Yes
bread     No
dtype: object

/tmp/ipykernel_2203/2631171198.py:13: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print('Do we need bread:\n', groceries[[-1]]) # Returns a series
/tmp/ipykernel_2203/2631171198.py:16: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print('How many eggs do we need to buy:', groceries[0]) # Returns a single value

##### Mutate Elements

In [5]:
print('Original Grocery List:\n', groceries)

groceries['eggs'] = 2

print()
print('Modified Grocery List:\n', groceries)

groceries['eggs'] = 30

Original Grocery List:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object

Modified Grocery List:
 eggs        2
apples      6
milk      Yes
bread      No
dtype: object

##### Delete Elements

`Series.drop(label)` removes `label` from `Series` out of place (original is unchanged). By setting keyword `inplace` to `True`, we can delete items from a Pandas Series in place.

In [6]:
print('Oringinal Grocery List:\n', groceries)

print()
print('We remove apples (out of place):\n', groceries.drop('apples'))

print()
print('Grocery List after removing apples out of place:\n', groceries)

Oringinal Grocery List:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object

We remove apples (out of place):
 eggs      30
milk     Yes
bread     No
dtype: object

Grocery List after removing apples out of place:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [7]:
print('Original Grocery List:\n', groceries)

groceries.drop('apples', inplace=True)

print()
print('Grocery List after removing apples in place:\n', groceries)

groceries = pd.concat([groceries, pd.Series(data=[6], index=['apples'])])

print()
print('Grocery List after adding apples back in:\n', groceries)

Original Grocery List:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object

Grocery List after removing apples in place:
 eggs      30
milk     Yes
bread     No
dtype: object

Grocery List after adding apples back in:
 eggs       30
milk      Yes
bread      No
apples      6
dtype: object

### Arithmetic

In [12]:
fruits = pd.Series([10,6,3], index=['apples', 'oranges', 'bananas'])

print('Original grocery list of fruits:\n', fruits)

print()
print('fruits + 2:\n', fruits + 2)
print()
print('fruits - 2:\n', fruits - 2)
print()
print('fruits * 2:\n', fruits * 2)
print()
print('fruits / 2:\n', fruits / 2)

Original grocery list of fruits:
 apples     10
oranges     6
bananas     3
dtype: int64

fruits + 2:
 apples     12
oranges     8
bananas     5
dtype: int64

fruits - 2:
 apples     8
oranges    4
bananas    1
dtype: int64

fruits * 2:
 apples     20
oranges    12
bananas     6
dtype: int64

fruits / 2:
 apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

In [15]:
print('Original grocery list of fruits:\n', fruits)
print()
print('EXP(X) = \n', np.exp(fruits))
print()
print('SQRT(X) = \n', np.sqrt(fruits))
print()
print('POW(X,2) = \n', np.power(fruits,2))

Original grocery list of fruits:
 apples     10
oranges     6
bananas     3
dtype: int64

EXP(X) =
 apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

SQRT(X) =
 apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

POW(X,2) =
 apples     100
oranges     36
bananas      9
dtype: int64

##### Arithmetic on Specific Items

In [16]:
print('Original grocery list of fruits:\n', fruits)
print()
print('Amount of bananas + 2 =', fruits['bananas'] + 2)
print()
print('Amount of apples - 2 =', fruits.iloc[0] - 2)
print()
print('We double the amount of apples and oranges:\n', fruits[['apples', 'oranges']] * 2)
print()
print('We half the amount of apples and oranges:\n', fruits.loc[['apples', 'oranges']] / 2)

Original grocery list of fruits:
 apples     10
oranges     6
bananas     3
dtype: int64

Amount of bananas + 2 = 5

Amount of apples - 2 = 8

We double the amount of apples and oranges:
 apples     20
oranges    12
dtype: int64

We half the amount of apples and oranges:
 apples     5.0
oranges    3.0
dtype: float64

Arithmetic operations can be applied to Pandas Series so long as the operation is defined for *all* data types in the Series. Otherwise, you will get an error.

In [19]:
print('Original grocery list:\n', groceries)
print()

print('groceries * 2:\n', groceries * 2)
print()

# This throws an error because we have a string data type
# print('groceries / 2:\n', groceries / 2)

Original grocery list:
 eggs       30
milk      Yes
bread      No
apples      6
dtype: object

groceries * 2:
 eggs          60
milk      YesYes
bread       NoNo
apples        12
dtype: object

### Quiz

In [20]:
# DO NOT CHANGE THE VARIABLE NAMES

# Given a list representing a few planets
planets = ['Earth', 'Saturn', 'Venus', 'Mars', 'Jupiter']

# Given another list representing the distance of each of these planets from the Sun
# The distance from the Sun is in units of 10^6 km
distance_from_sun = [149.6, 1433.5, 108.2, 227.9, 778.6]

# TO DO: Create a Pandas Series "dist_planets" using the lists above, representing the distance of the planet from the Sun.
# Use the `distance_from_sun` as your data, and `planets` as your index.
dist_planets = pd.Series(data=distance_from_sun, index=planets)

# TO DO: Calculate the time (minutes) it takes light from the Sun to reach each planet. 
# You can do this by dividing each planet's distance from the Sun by the speed of light.
# Use the speed of light, c = 18, since light travels 18 x 10^6 km/minute.
c = 18
time_light = dist_planets / c

# TO DO: Use Boolean indexing to select only those planets for which sunlight takes less
# than 40 minutes to reach them.
# We'll check your work by printing out these close planets.
close_planets = time_light[time_light < 40]

print('Close planets:\n', close_planets)

Close planets:
 Earth     8.311111
Venus     6.011111
Mars     12.661111
dtype: float64

### `DataFrame`s

##### Creating `DataFrame`s

Pandas `DataFrame`s are two-dimensional data structures with labeled rows and columns that can hold many data types. There are like tables in an Excel spreadsheet.

In [21]:
items = {'Bob': pd.Series(data=[245, 25, 55], index=['bike', 'pants', 'watch']),
         'Alice': pd.Series(data=[40, 110, 500, 45], index=['book', 'glasses', 'bike', 'pants'])}

print(type(items))

<class 'dict'>

In [38]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

Note a few things.

* The rows of the `DataFrame` are built from the *union* of the index labels of the two Pandas `Series`.
* The column labels of the `DataFrame` are taken from the *keys* of the dictionary.
* `NaN` values appear in the `DataFrame` where there is not a value for that particular row and column index.
    * The `NaN` values would need to be removed before sending to a machine learning algorithm.
* Each of the Pandas `Series` that were used to create the `DataFrame` had clearly defined indexes.
    * If no labels are provided to the `Series`, Pandas will use numerical row indexes.

In [39]:
data = {'Bob': pd.Series(data=[245, 25, 55]),
        'Alice': pd.Series(data=[40, 110, 500, 45])}

df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

##### `DataFrame` attributes

In [37]:
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [36]:
print('shopping carts has shape:', shopping_carts.shape)
print('shopping carts has dimension:', shopping_carts.ndim)
print('shopping carts has a total of', shopping_carts.size, 'elements')
print()
print('The data in shopping carts is:\n', shopping_carts.values)
print()
print('The row index in shopping carts is:', shopping_carts.index)
print()
print('The column index in shopping carts is:', shopping_carts.columns)

shopping carts has shape: (5, 2)
shopping carts has dimension: 2
shopping carts has a total of 10 elements

The data in shopping carts is:
 [[245. 500.]
 [ nan  40.]
 [ nan 110.]
 [ 25.  45.]
 [ 55.  nan]]

The row index in shopping carts is: Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

The column index in shopping carts is: Index(['Bob', 'Alice'], dtype='object')

Pandas allows us to select which data we want to put into our `DataFrame` by means of the keywords `columns` and `index`.

In [35]:
print(items)
print()

print()
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

{'Bob': bike     245
pants     25
watch     55
dtype: int64, 'Alice': book        40
glasses    110
bike       500
pants       45
dtype: int64}

       Bob
bike   245
pants   25
watch   55

In [33]:
sel_shopping_cart = pd.DataFrame(items, index=['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [34]:
alice_sel_shopping_cart = pd.DataFrame(items, index=['glasses', 'bike'], columns=['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

##### Create a `DataFrame` with a `dict` of `list`s

Since `data` does not have label indicies, Pandas automatically uses numerical row indexes when it creates the `DataFrame`.

In [41]:
data = {'Integers': [1, 2, 3],
        'Floats': [4.5, 8.2, 9.6]}

df = pd.DataFrame(data)
df

   Integers  Floats
0         1     4.5
1         2     8.2
2         3     9.6

In [42]:
df = pd.DataFrame(data, index=['label 1', 'label 2', 'label 3'])
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

##### Create a `DataFrame` using a `list` of `dict`s

In [43]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35},
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]

store_items = pd.DataFrame(items2, index=['store 1', 'store 2'])
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

##### Accessing Elements in `DataFrame`s

When accessing individual elements in a `DataFrame`, the labels should always be provided with the column first in the form `dataframe[column][index]`. If you provide the row label first, you will get an error.

In [44]:
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

In [50]:
print('How many bikes are in each store:\n', store_items[['bikes']]) # Returns a dataframe
# print('How many bikes are in each store:\n', store_items['bikes']) # Returns a series with Name equal to the column name
print()
print('How many bikes and pants are in each store:\n', store_items[['bikes', 'pants']]) # Returns a dataframe
print()
print('What items are in Store 1:\n', store_items.loc[['store 1']]) # Returns a dataframe
# print('What items are in Store 1:\n', store_items['store 1']) # Returns a series with Name equal to the column name
print()
print('How many bikes are in Store 2:', store_items['bikes']['store 2']) # Returns a single value

How many bikes are in each store:
          bikes
store 1     20
store 2     15

How many bikes and pants are in each store:
          bikes  pants
store 1     20     30
store 2     15      5

What items are in Store 1:
          bikes  pants  watches  glasses
store 1     20     30       35      NaN

How many bikes are in Store 2: 15

##### Add columns to an existing `DataFrame`

In [51]:
store_items['shirts'] = [15, 2]
store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      15
store 2     15      5       10     50.0       2

In [52]:
store_items['suits'] = store_items['pants'] + store_items['shirts']
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN      15     45
store 2     15      5       10     50.0       2      7

##### Add rows to an existing `DataFrame`

In [53]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index=['store 3'])
new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [56]:
store_items = pd.concat([store_items, new_store])
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN    15.0   45.0
store 2     15      5       10     50.0     2.0    7.0
store 3     20     30       35      4.0     NaN    NaN

##### Adding columns from existing data

In [58]:
store_items['new_watches'] = store_items['watches'][1:]
store_items

         bikes  pants  watches  glasses  shirts  suits  new_watches
store 1     20     30       35      NaN    15.0   45.0          NaN
store 2     15      5       10     50.0     2.0    7.0         10.0
store 3     20     30       35      4.0     NaN    NaN         35.0

##### Inserting columns

In [59]:
store_items.insert(5, 'shoes', [8, 5, 0])
store_items

         bikes  pants  watches  glasses  shirts  shoes  suits  new_watches
store 1     20     30       35      NaN    15.0      8   45.0          NaN
store 2     15      5       10     50.0     2.0      5    7.0         10.0
store 3     20     30       35      4.0     NaN      0    NaN         35.0

##### Deleting columns

`.pop()` allws us to delete columns. `.drop()` allows us to delete both rows and columns by use of the `axis` keyword.

In [60]:
store_items.pop('new_watches')
store_items

         bikes  pants  watches  glasses  shirts  shoes  suits
store 1     20     30       35      NaN    15.0      8   45.0
store 2     15      5       10     50.0     2.0      5    7.0
store 3     20     30       35      4.0     NaN      0    NaN

In [61]:
store_items = store_items.drop(['watches', 'shoes'], axis=1)
store_items

         bikes  pants  glasses  shirts  suits
store 1     20     30      NaN    15.0   45.0
store 2     15      5     50.0     2.0    7.0
store 3     20     30      4.0     NaN    NaN

In [62]:
store_items = store_items.drop(['store 1', 'store 2'], axis=0)
store_items

         bikes  pants  glasses  shirts  suits
store 3     20     30      4.0     NaN    NaN

##### Modifying the column label

In [63]:
store_items = store_items.rename(columns={'bikes': 'hats'})
store_items

         hats  pants  glasses  shirts  suits
store 3    20     30      4.0     NaN    NaN

##### Modifying the row label

In [65]:
store_items = store_items.rename(index={'store 3': 'last store'})
store_items

            hats  pants  glasses  shirts  suits
last store    20     30      4.0     NaN    NaN

##### Use existing columns values as row-index

In [66]:
store_items = store_items.set_index('pants')
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN

In [79]:
print('store_items:\n', store_items)
print()
print('store_items has shape:', store_items.shape)
print('store_items has dimension:', store_items.ndim)

store_items:
        hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN

store_items has shape: (1, 4)
store_items has dimension: 2
store_items.values:
 [[20.  4. nan nan]]

### `NaN`

Pandas assigns `NaN` to missing data. Prior to training our learning algorithms, we usually need to clean the data first. This typically means haveing a pipeline or metho for detecting and correcting errors in our data.

In [80]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes': 8, 'suits': 45},
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5, 'shirts': 2, 'shoes': 5, 'suits': 7},
          {'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes': 10}]

store_items = pd.DataFrame(items2, index=['store 1', 'store 2', 'store 3'])
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

##### Count the total `NaN` values

In [81]:
store_items.isnull()

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1  False  False    False   False  False  False     True
store 2  False  False    False   False  False  False    False
store 3  False  False    False    True  False   True    False

In [85]:
store_items.isnull().sum()

bikes      0
pants      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
dtype: int64

In [87]:
print('The number of NaN values in our DataFrame is:', store_items.isnull().sum().sum())

The number of NaN values in our DataFrame is: 3

##### Count the total non-`Nan` values

In [88]:
store_items.count()

bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

In [90]:
print('The number of non-NaN values in our DataFrame is:', store_items.count().sum())

The number of non-NaN values in our DataFrame is: 18

##### Eliminating `NaN` values

In general, there are two options to dealing with `NaN` values. We can either *delete* or *replace* them.

We can eliminate rows or columns using `.dropna(axis)`. If `axis=0`, the method eliminates any *rows* with `NaN` value(s). If `axis=1`, the method eliminates any *columns* with `NaN` value(s).

The `.dropna` does not modify the original `DataFrame` and is executed out of place. You can execute the method in place by setting the keyword `inplace=True`.

**Remember**: Read `axis=0` as **down** and `axis=1` as **across**.

In [92]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [91]:
store_items.dropna(axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [93]:
store_items.dropna(axis=1)

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

##### Substituting `NaN` values

`.fillna(value)` is used to replace all `NaN` with the designated value.

In [98]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [94]:
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

We can also use the `.ffill()` method to replace `NaN` values with previous column or row values in the `DataFrame`. This is known as *forward filling*.

`.ffill(axis)` will use the forward filling method to replace `NaN` values using the previous known value along the given `axis`.

In [96]:
store_items.ffill(axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

Note: Because there is not a value before the first value in the `glasses` column, `NaN` remains.

In [97]:
store_items.ffill(axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

We can also use the `.bfill()` method to replace `NaN` values with column or row values that go after them in the `DataFrame`. This is known as *backward filling*.

`.bfill(axis)` will use the backward filling method to replace `NaN` values using the known value after it along the given `axis`.

In [99]:
store_items.bfill(axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     50.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

NOTE:  Because there are not values that follow the last row in the `shirts` and `suits` columns, `NaN` remains.

In [100]:
store_items.bfill(axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0      NaN
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    10.0   10.0    4.0      4.0

NOTE: Because there is not a value in the `store 1` row after the `glasses` column, `NaN` remains.

Both `.ffill()` and `.bfill()` are executed out of place. However, you can execute in place by setting keyword `inplace=True`.

##### Interpolation

We can replace `NaN` values using different interpolation methods.

`.interpolate(method='linear',axis)` will use `linear` interpolation to replace `NaN` values along the given `axis`. Just as with the other methods, we can set `inplace=True` to operate in place on the current `DataFrame`.

In [103]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [101]:
store_items.interpolate(method='linear', axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

NOTE: Because there are no rows before `store 1`, the interpolation function cannot calculate a value for the `NaN` value in the `glasses` column.

In [102]:
store_items.interpolate(method='linear', axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    22.5   10.0    7.0      4.0

### Quiz

In [138]:
# DO NOT CHANGE THE VARIABLE NAMES

# Set the precision of our dataframes to one decimal place.
pd.set_option('display.precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a series of books. 
# The ratings given are in the range from 1 to 5, with 5 being the best score. 
# The names of the books, the corresponding authors, and the ratings of each user are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

# User ratings are in the order of the book titles mentioned above
# If a user has not rated all books, Pandas will automatically consider the missing values as NaN.
# If a user has mentioned `np.nan` value, then also it means that the user has not yet rated that book.
user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])


# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. 
# Let Pandas automatically assign numerical row indices to the DataFrame. 

# TO DO: Create a dictionary with the data given above
ratings = {'Author': authors, 'Book Title': books, 'User 1': user_1, 'User 2': user_2, 'User 3': user_3, 'User 4': user_4}

# TO DO: Create a Pandas DataFrame using the dictionary created above
df = pd.DataFrame(ratings)
print('Orginal DataFrame:')
display(df)

# TO DO:
# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 
# 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4' 
# and row indices 0 through 4.

# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place. 
# HINT: Use the `pandas.DataFrame.fillna(value, inplace = True)` function for substituting the NaN values. 
# Write your code below:
print()
print('DataFrame after replacing all NaN values with average rating:')
df.fillna(df[['User 1', 'User 2', 'User 3', 'User 4']].mean(), inplace=True)
display(df)

# Now pick all of the books that had a rating of 5.
print()
print('All books that received a rating of 5:')
print(*df[(df == 5).any(axis=1)]['Book Title'].values, sep='\n')

Orginal DataFrame:

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     NaN     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     NaN     4.0
3          H. G. Wells     The Time Machine     NaN     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     NaN     NaN     NaN     4.2

DataFrame after replacing all NaN values with average rating:

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     2.9     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     2.8     4.0
3          H. G. Wells     The Time Machine     2.9     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     2.9     3.5     2.8     4.2

All books that received a rating of 5:
Great Expectations
The Time Machine

### Loading Data into `DataFrame`s

Using machine learning, you will likely use databases from many sources to train your algorithms. Pandas allows us to load databases of different formats into DataFrames.

##### Loading data from `.csv` files

In [167]:
Google_stock = pd.read_csv('./data/GOOG.csv')

print('Google_stock is of type:', type(Google_stock))
print('Google_stock has shape:', Google_stock.shape)
display(Google_stock.head())
print('...')
display(Google_stock.tail())
print()
print('Google_stock has types:\n', Google_stock.dtypes)

Google_stock is of type: <class 'pandas.core.frame.DataFrame'>
Google_stock has shape: (3313, 7)

         Date      Open      High       Low     Close  Adj Close    Volume
0  2004-08-19  49.67690  51.69378  47.66995  49.84580   49.84580  44994500
1  2004-08-20  50.17863  54.18756  49.92529  53.80505   53.80505  23005800
2  2004-08-23  55.01717  56.37334  54.17266  54.34653   54.34653  18393200
3  2004-08-24  55.26058  55.43942  51.45036  52.09616   52.09616  15361800
4  2004-08-25  52.14087  53.65105  51.60436  52.65751   52.65751   9257400

...

,Date,Open,High,Low,Close,Adj Close,Volume
3308,2017-10-09,980.00000,985.42499,976.10999,977.00000,977.00000,891400
3309,2017-10-10,980.00000,981.57001,966.08002,972.59998,972.59998,968400
3310,2017-10-11,973.71997,990.71002,972.25000,989.25000,989.25000,1693300
3311,2017-10-12,987.45001,994.12000,985.00000,987.83002,987.83002,1262400
3312,2017-10-13,992.00000,997.21002,989.00000,989.67999,989.67999,1157700

Google_stock has types:
 Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

In [172]:
Google_stock['Date'] = pd.to_datetime(Google_stock['Date'])
Google_stock.dtypes

Date         datetime64[ns]
Open                float64
High                float64
Low                 float64
Close               float64
Adj Close           float64
Volume                int64
dtype: object

##### Check for `NaN` values

In [174]:
Google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

##### Get descriptive statistics

In [173]:
Google_stock.describe()

,Date,Open,High,Low,Close,Adj Close,Volume
count,3313,3313.00000,3313.00000,3313.00000,3313.00000,3313.00000,3.31300e+03
mean,2011-03-18 04:17:44.895864576,380.18609,383.49374,376.51931,380.07246,380.07246,8.03848e+06
min,2004-08-19 00:00:00,49.27452,50.54128,47.66995,49.68187,49.68187,7.90000e+03
25%,2007-12-03 00:00:00,226.55647,228.39452,224.00308,226.40744,226.40744,2.58490e+06
50%,2011-03-17 00:00:00,293.31229,295.43350,289.92929,293.02911,293.02911,5.28130e+06
75%,2014-07-02 00:00:00,536.65002,540.00000,532.40997,536.69000,536.69000,1.06537e+07
max,2017-10-13 00:00:00,992.00000,997.21002,989.00000,989.67999,989.67999,8.27681e+07
std,NaN,223.81865,224.97453,222.47323,223.85378,223.85378,8.39952e+06

In [146]:
Google_stock['Adj Close'].describe()

count    3313.0
mean      380.1
std       223.9
min        49.7
25%       226.4
50%       293.0
75%       536.7
max       989.7
Name: Adj Close, dtype: float64

In [156]:
print('Maximum values of each column:\n', Google_stock.max())
print()
print('Minimum Close value: {:.1f}'.format(Google_stock['Close'].min()))
print()
print('Average value of each column:\n', Google_stock.drop(['Date'], axis=1).mean())

Maximum values of each column:
 Date         2017-10-13
Open              992.0
High              997.2
Low               989.0
Close             989.7
Adj Close         989.7
Volume         82768100
dtype: object

Minimum Close value: 49.7

Average value of each column:
 Open         3.8e+02
High         3.8e+02
Low          3.8e+02
Close        3.8e+02
Adj Close    3.8e+02
Volume       8.0e+06
dtype: float64

In [160]:
pd.set_option('display.precision', 5)
Google_stock.drop(['Date'], axis=1).corr()

              Open     High      Low    Close  Adj Close   Volume
Open       1.00000  0.99990  0.99985  0.99975    0.99975 -0.56426
High       0.99990  1.00000  0.99983  0.99987    0.99987 -0.56275
Low        0.99985  0.99983  1.00000  0.99990    0.99990 -0.56701
Close      0.99975  0.99987  0.99990  1.00000    1.00000 -0.56497
Adj Close  0.99975  0.99987  0.99990  1.00000    1.00000 -0.56497
Volume    -0.56426 -0.56275 -0.56701 -0.56497   -0.56497  1.00000

### `groupby()`

`.groupby()` allows us to group data in different ways.

In [161]:
data = pd.read_csv('./data/fake-company.csv')
data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000
5  1991    Frank      Admin   46   60000
6  1992    Grace      Admin   27   60000
7  1992  Hoffman         RD   32   52000
8  1992    Inaar      Admin   28   62000

In [168]:
data.dtypes

Year           int64
Name          object
Department    object
Age            int64
Salary         int64
dtype: object

In [163]:
data.groupby(['Year'])['Salary'].sum()
# data.where(data['Year'] == 1990)['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [166]:
data.groupby(['Year'])['Salary'].mean()
# data.where(data['Year'] == 1990)['Salary'].mean()

Year
1990    51000.0
1991    54000.0
1992    58000.0
Name: Salary, dtype: float64